<!DOCTYPE html><html lang="es">
<head>
  <title>Discapacidad - REAVAI: Accesibilidad Web</title>
  <meta charset="utf-8">
  <link href="https://stackpath.bootstrapcdn.com/bootstrap/4.1.3/css/bootstrap.min.css" rel="stylesheet"/>
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <meta name="author" content="Abel Jiménez Urbaneja" />
  <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/4.1.3/css/bootstrap.min.css">
  <script src="https://ajax.googleapis.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
  <script src="https://cdnjs.cloudflare.com/ajax/libs/popper.js/1.14.3/umd/popper.min.js"></script>
  <script src="https://maxcdn.bootstrapcdn.com/bootstrap/4.1.3/js/bootstrap.min.js"></script>
  <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css">
  <link rel="icon" href="img/miniatura.ico" type="image/x-icon" />
  <link rel="stylesheet" type="text/css" media="all" href="css/estiloInicio.css" title="Normal" />
  <script src="js/dobleScroll.js"></script>
  <script src="js/cerrarTrasTab.js"></script>
</head>

<body>

		<!-- Saltar -->
<div id="enlaces" role="navigation">
<ul id="listaCambiante">
<li><a href="#menu">Saltar al menú principal</a></li>
<li><a href="#contenido">Saltar al contenido</a></li>
</ul></div><br>
	<!-- Fin Saltar -->
	
	<!-- Cabecera -->
<div id="cabecera">
	<div id="logo1">
	<a href="http://abelbdho.github.io"><img class="imagen" src="img/reavaiDef.png" alt="REAVAI logo" /></a>
	</div>
<div id="logo2">
<a href="http://www.uma.es/"><img class="imagen" src="img/uma.png" alt="Universidad de Málaga logo" /></a>
</div></div>

	<!-- Fin Cabecera -->
	
<!--MENU VERTICAL-->
	
	<nav class="menu">
	<a href="#" id="inicio">Inicio</a>
	<a class="principio" href="perceptible.html">1. Perceptible</a>
	<a href="1.1A.html">1.1 Alternativas textuales</a>
	<a href="1.2A.html">1.2 Medios tempodependientes</a>
	<a href="1.3A.html">1.3 Adaptable</a>
	<a href="1.4A.html">1.4 Distinguible</a>
	<a class="principio" href="operable.html">2. Operable</a>
	<a href="2.1A.html">2.1 Accesible por teclado</a>
	<a href="2.2A.html">2.2 Tiempo suficiente</a>
	<a href="2.3A.html">2.3 Convulsiones</a>
	<a href="2.4A.html">2.4 Navegable</a>
	<a class="principio" href="entendible.html">3. Entendible</a>
	<a href="3.1A.html">3.1 Legible</a>
	<a href="3.2A.html">3.2 Predecible</a>
	<a href="3.3A.html">3.3 Entrada de datos asistida</a>
	<a class="principio" href="4.1A.html">3. Robusto</a>
	<a href="4.1A.html">3.1 Compatible</a>
	<a class="principio" href="aleatorio.html">Aleatorio</a>
	<a id="activo" class="principio" href="#">Discapacidad</a>
	</nav><br>
	
	<!--FIN MENU VERTICAL-->
	
	<!--SOL-->
	
	<picture id="sol">
	<source media="(min-width: 465px)" srcset="img/solFeliz.png">
	<img class="contentImage" src="img/solFeliz.png" alt=""/>
	</picture>
	
	<!--FIN SOL-->
	
	<!-- Contenido -->

<div id="contenido">
	
	
	<ul class="breadcrumb">
		<li><a class="enlacesOscuros" href="index.html">Inicio</a></li>
		<li>Discapacidad</li>
		</ul>
	
<h1>¿Qu&eacute; es la discapacidad?</h1>

<p>
	La discapacidad est&aacute; caracterizada por el resultado de una compleja interacci&oacute;n entre el estado de salud de una persona y los factores personales y ambientales, que representan las
	 circunstancias en las que vive la persona (OMS, 2001).
</p>
<p>
	Es decir, la discapacidad no es &uacute;nicamente consecuencia del estado de salud del individuo, sino que adem&aacute;s se ve afectada por las circunstancias personales y de contexto. As&iacute;, distintos ambientes/contextos
	 (con o sin barreras) pueden tener impactos diferentes en el desempeño/realizaci&oacute;n del mismo individuo.
</p>
<br>

<h2>Deficiencias visuales</h2><br>
		
		<h3>Ceguera al color (daltonismo)</h3>

		<p>
			El ojo humano contiene bastones y conos, estos &uacute;ltimos están especializados en los colores. Cuando existe una deficiencia o falta en algunos de los tipos de conos presentes en el ojo, se producen defectos en la visuzalizaci&oacute;n de los colores.
		</p>
		
		<p>
			Ante este problema, la soluci&oacute;n es la de no codificar ninguna conducta o informaci&oacute;n importante &uacute;nicamente mediante colores, comprobar la visualizaci&oacute;n en distintas condiciones y utilizar colores perfectamente distinguibles.
		</p>
		
		<h3>Visi&oacute;n reducida</h3>

		<p>
			Las discapacidades visuales van desde una falta de agudeza hasta la completa falta de la visi&oacute;n. La visi&oacute;n reducida es la que no se puede corregir con gafas, lo que interfiere con las actividades diarias como leer y conducir. Es m&aacute;s com&uacute;n a una mayor edad.
		</p>
		
		<p>
			En este caso es recomendable el ajustar un alto contraste entre elementos, evitar desplazamientos horizontales, fuentes predilectas y colores de fondo, etc.; además, el uso de magnificadores de pantalla o lupas.
		</p>
		
		<h3>Ceguera</h3>

		<p>
			Cuando las deficiencias visuales llegan al l&iacute;mite en el que no es posible utilizar la informaci&oacute;n en pantalla, es preciso acudir a un nuevo canal de comunicaci&oacute;n. Los m&aacute;s aprovechables son la voz y el tacto.
		</p>
		
		<p>
			Proporcionar toda la informaci&oacute;n necesaria en forma de texto es vital para aquellas personas que usen lectores de pantalla. Asegurarse de que todos los elementos de la interfaz pueden ser accesibles a trav&eacute;s del teclado es tambi&eacute;n esencial. Hay multitud de criterios para
			que el contenido web accedido a trav&eacute;s de estos dispositivos presente la misma informaci&oacute;n que una pantalla.
			
		</p><br><br>
		
<h2>Deficiencias auditivas</h2>
		
		<p>
			En general estas personas deben encontrar menos problemas en el acceso a la web. En ocasiones hay cierta informaci&oacute;n que es necesario convertir en texto para que los usuarios sean capaces de seguirla como pueden ser avisos o mensajes de alerta sonoros.
		</p>	
		<p>
			Hay personas que utilizan en lenguaje de signos desde su nacimiento. Estas personas tienen a menudo una reducci&oacute;n importante en el n&uacute;mero de palabras que conocen. Por ello, es necesario prestar atenci&oacute;n al vocabulario usado.
		</p><br><br>
		
<h2>Deficiencias m&oacute;viles</h2>
		
		<p>
			En esta categor&iacute;a entran personas con problemas para realizar ciertas tareas f&iacute;sicas como mover un puntero, pulsar dos teclas a la vez, etc.; al igual que personas con casos m&aacute;s extremos, que deben usar dipositivos por voz o mediante movimientos de otras partes del cuerpo (capeza, boca, etc.).
		</p>	
		<p>
			Es conveniente proporcionar a  las aplicaciones una interfaz basada en teclado lo m&aacute;s completa posible. Si se utiliza un sistema de introducci&oacute;n vocal de la informaci&oacute;n, un correcto etiquetado de los elementos en la p&aacute;gina puede ser esencial para su uso.
		</p><br><br>
		
<h2>Deficiencias cognitivas</h2>
		
		<p>
			Estas deficiencias ya no solo se refieren a enfermedades, el envejecimiento de la poblaci&oacute;n est&aacute; muy relacionado con ello. Dentro de lo que son las enfermedades cognitivas se pueden clasificar seg&uacute;n diagn&oacute;stico cl&iacute;nico (autismo, demencia, etc.) o seg&uacute;n funcionalidad afectada (memoria, atenci&oacute;n, etc.).
		</p>		
		<p>
			Algunos buenas pr&aacute;cticas son claridad y sencillez en el diseño, contenidos, etc.; medios suplementarios: ilustraciones, iconos, etc.; estructura definida...
		</p>
		
</div>
<!-- Fin Contenido -->


</body>
