<html lang="es">
<head>
  <title>Inicio - REAVAI: Accesibilidad Web</title>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <meta name="author" content="Abel Jiménez Urbaneja" />
  <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/4.1.3/css/bootstrap.min.css">
  <script src="https://ajax.googleapis.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
  <script src="https://cdnjs.cloudflare.com/ajax/libs/popper.js/1.14.3/umd/popper.min.js"></script>
  <script src="https://maxcdn.bootstrapcdn.com/bootstrap/4.1.3/js/bootstrap.min.js"></script>
  <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css">
  <link rel="icon" href="img/miniatura.ico" type="image/x-icon" />
  <link rel="stylesheet" type="text/css" media="all" href="css/estiloInicio.css" title="Normal" />
</head>

<body>

		<!-- Saltar -->
<div id="enlaces" role="navegacion">
<ul id="listaCambiante">
<li><a href="#menu">Saltar al menú principal</a></li>
<li><a href="#contenido">Saltar al contenido</a></li>
</ul></div><br>
	<!-- Fin Saltar -->
	
	<!-- Cabecera -->
<div id="cabecera">
<div id="logo1">
<a href="http://www.uma.es/"><img id="imagen" src="img/uma.png" alt="Universidad de Málaga" /></a>
</div>
<h1><a href="#">REAVAI: Accesibilidad Web</a></h1>
</div>
	<!-- Fin Cabecera -->
	
	<!--MENU VERTICAL-->
	
	<div class="menu">
	<a href="#" class="active">Inicio</a>
	<a href="introA.html">Introducci&oacute;n</a>
	<a href="#">Link 2</a>
	<a href="#">Link 3</a>
	<a href="#">Link 4</a>
	</div><br>
	
	<!--FIN MENU VERTICAL-->
	
	<!-- Contenido -->

<div id="contenido">
	<h2 class="screen-reader-text">Contenido</h2>
<h2>¿Qué es la accesibilidad web?</h2><br>

<p>
	Cuando una página web está diseñada adecuadamente, de manera que personas con discapacidades puedan acceder a ella sin problemas, hablamos de <strong>accesibilidad web</strong>.
		La accesibilidad web indica la capacidad de acceso a la web y a sus contenidos por todas las personas, independientemente de su discapacidad o contexto de uso.
		En concreto, se hace referencia al diseño web que permite que estas personas puedan percibir, entender, navegar e interactuar con la web.
		Así, es posible proporcionar un acceso equitativo e igualdad de oportunidades a las personas con dificultades, una oportunidad de acceder a la información y de interactuar
		en los distintos aspectos de la vida: educación, empleo, sanidad...
</p> 

<h2>Objetivo de esta web</h2><br>
		<p>
			El principal objetivo de esta p&aacute;gina web es el de concienciar y dar visibilidad a la importancia de la accesibilidad desde un punto de vista did&aacute;ctivo e instructivo.
			Se proporciona información sobre la accesibilidad web: su motivaci&oacute;n, beneficios, etc, así como ejemplos de buena o mala accesibilidad.
		</p>

<h3>Ejemplo</h3><br>
		<p>
			<p>Aqu&iacute; se muestra como ejemplo una de las etiquetas que pueden aparecer más adelante. En este caso, hace referencia a la barra de navegación que encabeza el contenido de la p&aacute;gina,
			oculta, desde la cual se puede saltar al menú o contenido. Mediante este primer elemento las personas con dificultades visuales que usen un lector web pueden usar
			ese enlace para saltar directamente al contenido y no volver a repetir el &iacute;ndice en caso de que ya lo hayan hecho. Estas etiquetas aparecer&aacute;n junto al criterio/infracci&oacute;n,
			son de color azul y estarán numeradas en cada página.</p>
			<a href="#ejemploCollap" class="btn btn-primary" data-toggle="collapse">1</a>
			<div id="ejemploCollap" class="collapse">
			<span class="collapseTitulo" id="tituloCollapse">Saltar contenido repetido</span>
			<div><strong>Principio de Operabilidad, gu&iacute;a de navegaci&oacute;n, criterio: <em>Evitar Bloques</em></strong><br>
			Debe haber medios para saltar bloques de contenido repetidos en una p&aacute;gina web.<br>
			Nivel A,<br>
			<strong><xmp><div id="enlaces"><ul><li><a href="#menu">Saltar al menú principal</a></li></xmp>
			<xmp>#enlaces { overflow: hidden;</xmp></strong>
			<a href="https://www.w3.org/WAI/WCAG21/quickref/#bypass-blocks" target=”_blank”>Criterio~WCAG</a>
			</div>
			</div>
			<br><br>
			<p>Conforme se navega por la página se encuentran este tipo de referencias a la vez que se informa sobre distintos aspectos de la accesibilidad.</p>
		</p>
		
<h2>Tipos de discapacidad</h2><br>
		<p>
			Una discapacidad puede ser de car&aacute;cter auditivo, cognitivo, f&iacute;sico, visual o del habla. No distinguen sexos ni edad, una persona puede verse impedida a lo largo de su vida a partir de un
			 accidente o enfermedad; si bien puede ser algo de nacimiento. Muchas veces, sin ser realmente conscientes de ellos, las personas sufren limitaciones en algunos de los mencionados aspectos sin 
			 ser considerado como una discapacidad. Por ello, es importante categorizar estas discapacidades o disfunciones seg&uacute;n su tipo.
			 
			 <p>De la misma manera que a las personas discapacitadas, la accesibilidad web ata&ntilde;e a todo tipo de persona dadas situaciones adversas, m&aacute;s usuales de lo que se cree. Aqu&iacute; una pequeña tabla de
			 equivalencias:<p>
			 
			 <div id="tablas"><table>
			<tr>
			<th>Problema</th>
			<th>Discapacidad</th> 
			<th>Situaci&oacute;n adversa</th>
			</tr>
			<tr>
			<td>Sin visi&oacute;n</td>
			<td>Ceguera</td>
			<td>
			<ul>
				<li>Personas con los ojos ocupados (conduciendo)</li>
				<li>En la oscuridad</li>
			</ul>
			</td>
			</tr>
			<tr>
			<td>Poca visi&oacute;n</td>
			<td>Limitaciones visuales</td>
			<td>
			<ul>
				<li>Entorno con humo</li>
				<li>Personas con un visualizador pequeño</li>
			</ul>
			</td>
			</tr>
			<tr>
			<td>Sin poder o&iacute;r</td>
			<td>Sordera</td>
			<td>
			<ul>
				<li>Entornos ruidosos</li>
				<li>O&iacute;dos ocupados</li>
				<li>Silencio forzado (biblioteca, etc)</li>
			</ul>
			</td>
			</tr>
			<tr>
			<td>O&iacute;do limitado</td>
			<td>Sordera parcial</td>
			<td>
			<ul>
				<li>Entornos ruidosos</li>
			</ul>
			</td>
			</tr>
			<tr>
			<td>Manualidad limitada</td>
			<td>Limitaciones motrices</td>
			<td>
			<ul>
				<li>Indumentarias o vestidos especiales</li>
				<li>Terremotos</li>
			</ul>
			</td>
			</tr>
			<tr>
			<td>Cognitividad limitada</td>
			<td>Discapacidades cognitivas</td>
			<td>
			<ul>
				<li>Distracciones o d&eacute;dicit de atenci&oacute;n</li>
				<li>Situaciones de p&aacute;nico</li>
				<li>Bajo la influencia del alcohol</li>
			</ul>
			</td>
			</tr>
			<tr>
			<td>Sin lectura</td>
			<td>Discapacidades cognitivas</td>
			<td>
			<ul>
				<li>Personas que desconocen el lenguaje</li>
				<li>Personas que han olvidado las gafas de lectura</li>
			</ul>
			</td>
			</tr>
			</table></div><br>
		</p>
		
<h3>Discapacidad auditiva</h3><br>
		<p>
			La discapacidad auditiva va desde una leve o moderada p&eacute;rdida en la audici&oacute;n hasta la sordera total en uno o ambos o&iacute;dos. Algunas de estas personas pueden percibir est&iacute;mulos
			 auditivos pero no con la suficiente claridad o en todos los casos. Deben ser tenidos tambi&eacute;n en cuenta personas con dispositivos para la audici&oacute;n.
			 
			 <ul>
				<li><b>Dureza de o&iacute;do</b>: p&eacute;rdida leve o moderada de audici&oacute;n en uno o ambos o&iacute;dos.</li>
				<li><b>Sordera</b>: p&eacute;rdida total de la audici&oacute;n en uno o ambos o&iacute;dos.</li>
				<li><b>Sordera-Ceguera</b>: p&eacute;rdida tanto del sentido auditivo como del visual.</li>
			 </ul>
		</p>
		
<h3>Discapacidad cognitiva, neurol&oacute;gica y en el aprendizaje</h3><br>
		<p>
			Estos tipos de discapacidad incluyen des&oacute;rdenes neurol&oacute;gicos, as&iacute; como des&oacute;rdenes mentales o en el comportamiento de las personas. Pueden afectar a cualquier aspecto del sistema nervioso dificultando la audici&oacute;n,
			movimiento, habla... Las discapacidades cognitivas, neurol&oacute;gicas y en el aprendizaje no necesariamente afectan a la inteligencia de una persona.
			 
			 <ul>
				<li><b>Trastorno por d&eacute;ficit de atenci&oacute;n e hiperactividad</b>: dificultad para centrarse en una actividad y facilidad para la distracci&oacute;n.</li>
				<li><b>Autismo, s&iacute;ndrome de Asperger</b>: dificultad en la comunicaci&oacute;n e interacci&oacute;n con el entorno</li>
				<li><b>Discapacidad intelectual</b>: aprendizaje lento o dificultad en la asimilaci&oacute;n de conceptos complejos. El s&iacute;ndrome de Down es un ejemplo de discapacidad intelectual.</li>
				<li><b>Des&oacute;rdenes mentales</b>: ansiedad, delirio, depresi&oacute;n... Dificultan la focalizaci&oacute;n y asimilaci&oacute;n de informaci&oacute;n.</li>
				<li><b>Problemas de memoria</b>: p&eacute;rdida de memoria a corto o largo plazo, limitaciones... La demencia es un ejemplo de este tipo de problemas.</li>
				<li><b>Esclerosis m&uacute;ltiple</b>: daños en las c&eacute;lulas nerviosas del cerebro y espina dorsal, causando problemas auditivos, visuales...</li>
				<li><b>Neurodiversidad</b>: concepto en referencia a la diversidad en las caracter&iacute;sticas humanas, influenciada por variaciones normales en el campo neurol&oacute;gico.</li>
				<li><b>Discapacidad perceptiva</b>: dificultad para procesar informaci&oacute;n procedente de los sentidos visual, auditivo, t&aacute;ctil y otras informaciones sensoriales. Impacto en la lectura (dislexia), escritura (disgrafia)...</li>
				<li><b>Trastornos convulsivos</b>: epilepsia, migrañas... Reacciones a est&iacute;mulos visuales o señales auditivas con un patr&oacute;n o cierta frecuencia.</li>
			 </ul>
		</p>	
		
<h3>Discapacidad f&iacute;sica</h3><br>
		<p>
			La discapacidad f&iacute;sica puede incluir desde debilidad hasta limitaciones en el control muscular, carencia de alguna extremidad, dolor en el movimiento...
			 
			 <ul>
				<li><b>Amputaci&oacute;n</b>: carencia de dedos, extremidades u otras partes del cuerpo.</li>
				<li><b>Artritis</b>: inflamaci&oacute;n, degeneraci&oacute;n y daño en las articulaciones.</li>
				<li><b>Fibromialgia</b>: dolor cr&oacute;nico en m&uacute;sculos y conexiones.</li>
				<li><b>Reumatismo</b>: refiri&eacute;ndose a artritis y otras causas de dolor en huesos y articulaciones y fibromialgia y otras causas de dolor muscular o de otros tejidos.</li>
				<li><b>Distrofia muscular</b>: debilidad progresiva y degeneraci&oacute;n de los m&uacute;sculos.</li>
				<li><b>RSI</b>: daños en musculatura y esqueleto causados por esfuerzos repetitivos.</li>
				<li><b>Temblores y espasmos</b>: movimientos involuntarios o contracciones en los m&uacute;sculos.</li>
				<li><b>Tetraplejia</b>: par&aacute;lisis parcial o total de las cuatro extremidades del cuerpo.</li>
			 </ul>
		</p>
		
<h3>Discapacidad en el habla</h3><br>
		<p>
			La incapacidad de producir un discurso inteligible para otros o para un software de reconocimiento forman parte de este tipo de discapacidad.
			 
			 <ul>
				<li><b>Apraxia del habla</b>: incluye problemas al articular y producir sonidos y errores que dificultan el entendimiento de palabras o frases.</b></li>
				<li><b>Taquifemia</b>: incremento en la velocidad del habla, ritmo incorrecto, imposibilidad de entonaci&oacute;n...</li>
				<li><b>Disartria</b>: engloba la debilidad o la par&aacute;lisis de los m&uacute;sculos necesarios para hablar: labios, pulmones, garganta...</li>
				<li><b>Desorden de la comunicaci&oacute;n</b>: dificultad o incapacidad para producir ciertos sonidos o patrones de sonidos y, a veces, distorsi&oacute;n, omisi&oacute;n o sustituci&oacute;n de unos sonidos por otros.</li>
				<li><b>Tartamudeo</b>: discurso entrecortado, repetici&oacute;n de sonidos o incluso palabras o frases completas y prolongaci&oacute;n de pausas y sonidos hablando.</li>
				<li><b>Mudez</b>: incapacidad para hablar. Puede ser debido a ansiedad, daños cerebrales o imposibilidad de audici&oacute;n y aprendizaje de la lengua.</li>
			 </ul>
		</p>	
		
<h3>Discapacidad visual</h3><br>
		<p>
			La discapacidad visual va de una leve o moderada p&eacute;rdida de visi&oacute;n en uno o ambos ojos hasta la total p&eacute;rdida de esta. Hay casos de sensibilidad o impercepci&oacute;n de ciertos colores. Estas variaciones pueden ser totalmente independientes
			 de la precisi&oacute;n visual.
			 
			 <ul>
				<li><b>Daltonismo</b>: dificultad para distinguir colores o todos ellos.</li>
				<li><b>Ceguera parcial</b>: poca agudeza visual, visi&oacute;n de t&uacute;nel o cataratas.</li>
				<li><b>Ceguera</b>: p&eacute;rdida de la visi&oacute;n en ambos ojos.</li>
				<li><b>Sordera-Ceguera</b>: p&eacute;rdida tanto del sentido auditivo como del visual.</li>
			 </ul>
		</p>				

</div>

<!-- Fin Contenido -->

</body>
